<a href="https://colab.research.google.com/github/sanha9999/Data_analysis/blob/main/python/Pandas/pandas_index.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

#1-1 리스트를 시리즈로 변환하여 변수 sr에 저장
list_data = ['2019-01-02',3-14,'ABC',100,True]
sr= pd.Series(list_data)
print(sr)

0    2019-01-02
1           -11
2           ABC
3           100
4          True
dtype: object

In [2]:
#1-1 리스트를 시리즈로 변환하여 변수 sr에 저장
list_data = ['2019-01-02',3-14,'ABC',100,True]
sr= pd.Series(list_data)
print(sr)

0    2019-01-02
1           -11
2           ABC
3           100
4          True
dtype: object

In [3]:
#1-2 인덱스 배열은 변수idx에 저장,데이터 값 배열은 변수 val에 저장
idx = sr.index
val = sr.values
print(idx)
print('n')
print(val)

RangeIndex(start=0, stop=5, step=1)
n
['2019-01-02' -11 'ABC' 100 True]

In [4]:
#1-3 투플을 시리즈로 변환(인덱스 옵션 지정)
tup_data = ('영인','2010-05-01','여', True)
sr = pd.Series(tup_data, index=['이름','생년월일','성별','학생여부'])
print(sr)

#원소를 한개 선택
print(sr[0])
print(sr['이름'])

# 여러 개의 원소를 선택(인덱스 리스트 활용)
print(sr[[1,2]])
print('\n')
print(sr[['생년월일','성별']])

#여러개의 원소를 선택 (인덱스 범위 지정)
print(sr[1:2])
print('\n')
print(sr[['생년월일','성별']])

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object
영인
영인
생년월일    2010-05-01
성별               여
dtype: object


생년월일    2010-05-01
성별               여
dtype: object
생년월일    2010-05-01
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

In [5]:
# 열이름을 key로 하고, 리스트를 value로 갖는 딕셔너리 정의(2차원 배열)
dict_data = {'c0': [1,2,3], 'c1':[4,5,6], 'c2':[7,8,9,], 'c3':[10,11,12], 'c4':[13,14,15]}

#판다스 dataframe{} 함수로 딕셔너리를 데이터프레임으로 변환. 변수 df에 저장
df = pd.DataFrame(dict_data)

#df의 자료형 출력
print(type(df))
print('\n')
#변수 df에 저장되어 있는 데이터프레임 객체를 출력
print(df)
df

<class 'pandas.core.frame.DataFrame'>


   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [6]:
#행 인덱스/열 이름 지정하여 데이터프레임 만들기
df = pd.DataFrame([[15, '남', '덕영중'],[17,'여','수리중']],
                  index = ['준서','예은'],
                  columns = ['나이','성별','학교'])

#데이터프레임 df 출력
print(df)
print("\n")

#열 이름 중, '나이'를 '연령'으로, '성별'을 '남여'로, '학교'를 소속으로 바꾸기
df.rename(columns={'나이':'연령','성별':'남여','학교':'소속'}, inplace=True)

# df의 행 인덱스 중에서, '준서'를 학생1로, 예은을 학생2로 바꾸자
df.rename(index={'준서':'학생1','예은':'학생2'}, inplace=True)

print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중


     연령 남여   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [7]:
exam_data = {'수학': [90,80,70], '영어': [98,89,95],
             '음악':[100,30,50], '체육': [57,37,84]}

df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
print(df)
print('\n')

#데이터프레임 df를 복제하여 변수 df2에 저장. df2의 1개의 행(row) 삭제
df2 = df[:]
df2.drop('우현', inplace=True)
print(df2)
print('\n')

#데이터 프레임 df를 복제하여 변수 df3에 저장, df3의 2개 행(row) 삭제
df3= df[:]
df3.drop(['우현','인아'],axis=0,inplace=True)
print(df3)

    수학  영어   음악  체육
서준  90  98  100  57
우현  80  89   30  37
인아  70  95   50  84


    수학  영어   음악  체육
서준  90  98  100  57
인아  70  95   50  84


    수학  영어   음악  체육
서준  90  98  100  57

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,
/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [8]:
exam_data = {'수학': [90,80,70], '영어': [98,89,95],
             '음악':[100,30,50], '체육': [57,37,84]}

df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
print(df)
print('\n')

#데이터프레임 df를 복제하여 변수 df2에 저장. df2의 1개의 행(row) 삭제
df4 = df[:]
df4.drop('수학',axis=1, inplace=True)
print(df2)
print('\n')

#데이터 프레임 df를 복제하여 변수 df3에 저장, df3의 2개 행(row) 삭제
df5= df.copy()
df5.drop(['영어','음악'],axis=1,inplace=True)
print(df)

    수학  영어   음악  체육
서준  90  98  100  57
우현  80  89   30  37
인아  70  95   50  84


    수학  영어   음악  체육
서준  90  98  100  57
인아  70  95   50  84


    수학  영어   음악  체육
서준  90  98  100  57
우현  80  89   30  37
인아  70  95   50  84

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4174: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [9]:
exam_data = {'수학': [90,80,70], '영어': [98,89,95],
             '음악':[100,30,50], '체육': [57,37,84]}

df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
print(df)
print('\n')

labell = df.loc['서준']
positionl = df.iloc[0]
print(labell)
print('\n')

print(positionl)


labell2 = df.loc[['서준', '우현']]
positionl2 = df.iloc[[0,1]]
print(labell2)
print('\n')

print(positionl2)


labell3 = df.loc['서준':'우현']
positionl3 = df.iloc[0:1]
print(labell3)
print('\n')

print(positionl3)

    수학  영어   음악  체육
서준  90  98  100  57
우현  80  89   30  37
인아  70  95   50  84


수학     90
영어     98
음악    100
체육     57
Name: 서준, dtype: int64


수학     90
영어     98
음악    100
체육     57
Name: 서준, dtype: int64
    수학  영어   음악  체육
서준  90  98  100  57
우현  80  89   30  37


    수학  영어   음악  체육
서준  90  98  100  57
우현  80  89   30  37
    수학  영어   음악  체육
서준  90  98  100  57
우현  80  89   30  37


    수학  영어   음악  체육
서준  90  98  100  57

In [10]:
# DataFrame 함수로 데이터프레임 변환
exam_data = {'이름' : ['서준', '우현', '인아'],
             '수학' : [90, 80, 70],
             '영어' : [98, 89, 95],
             '음악' : [85, 95, 100],
             '체육' : [100, 90, 90]}
df = pd.DataFrame(exam_data)

In [11]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [14]:
# 특정 열을 데이터 프레임의 행 인덱스로 설정
ndf = df.set_index(['이름'])
print(ndf)
print("\n")
ndf2 = ndf.set_index('음악')
print(ndf2)
print("\n")
ndf3 = ndf.set_index(['수학', '음악'])
print(ndf3)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90


     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90


        영어   체육
수학 음악
90 85   98  100
80 95   89   90
70 100  95   90

In [ ]:
5